package ch06.sec05;

/*
 	클래스 선언에는 객체 초기화 역할을 담당하는 생성자와
 	객체에 포함될 필드와 메소드를 선언하는 코드가 포함된다.
 	
 	생성자, 필드, 메소드를 클래스 구성 멤버라고 한다.
 	
 */
public class ClassName {
	// 필드 선언
	// int fieldName;
	// 객체의 데이터가 저장되는 곳
	
	// 생성자 선언
	// ClassName() {}
	// 객체 생성 시 초기화 역할 담당
	
	// 메소드 선언
	// int methodName() {}
	// 객체의 동작으로 호출 시 실행하는 블록
	
	
	/*
	 	필드(Field) : 객체의 데이터를 저장하는 역할
	 	선언 형태는 변수 선언과 비슷하지만 쓰임새는 다르다
	 	
	 	생성자(Constructor) : new 연산자로 객체를 생성할 때 객체의 초기화 역할을 담당
	 	선언 형태는 메소드랑 비슷하지만, 리턴 타입이 없고 이름은 클래스 이름과 동일하다
	 	
	 	메소드(Method) : 객체가 수행할 동작
	 	메소드는 객체와 객체 간의 상호 작용을 위해 호출된다.
	 	
	 */
}
